---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.HermiteSplineTangents
source: html/12f76835-f039-af24-ebef-834840ab6ab5.htm
---
# HermiteSplineTangents Members

Constructs a new default instance of the class, with tangent vectors uninitialized.